# Faster R-CNN with Inception Resnet v2, Atrous version;
# Configured for Duke Transmission Line dataset.

model {
  faster_rcnn {
    num_classes: 2
    image_resizer {
      fixed_shape_resizer {
        height: 500
        width: 500
      }
    }
    feature_extractor {
      type: 'faster_rcnn_inception_resnet_v2'
      first_stage_features_stride: 8
    }
    first_stage_anchor_generator {
      grid_anchor_generator {
        scales: [0.1, 0.2, 0.3, 0.4]
        aspect_ratios: [0.5, 1.0, 2.0]
        height_stride: 8
        width_stride: 8
      }
    }
    first_stage_atrous_rate: 2
    first_stage_box_predictor_conv_hyperparams {
      op: CONV
      regularizer {
        l2_regularizer {
          weight: 0.0
        }
      }
      initializer {
        truncated_normal_initializer {
          stddev: 0.01
        }
      }
    }
    first_stage_nms_score_threshold: 0.0
    first_stage_nms_iou_threshold: 0.7
    first_stage_max_proposals: 300
    first_stage_localization_loss_weight: 2.0
    first_stage_objectness_loss_weight: 1.0
    initial_crop_size: 17
    maxpool_kernel_size: 1
    maxpool_stride: 1
    second_stage_box_predictor {
      mask_rcnn_box_predictor {
        use_dropout: false
        dropout_keep_probability: 1.0
        fc_hyperparams {
          op: FC
          regularizer {
            l2_regularizer {
              weight: 0.0
            }
          }
          initializer {
            variance_scaling_initializer {
              factor: 1.0
              uniform: true
              mode: FAN_AVG
            }
          }
        }
      }
    }
    second_stage_post_processing {
      batch_non_max_suppression {
        score_threshold: 0.0
        iou_threshold: 0.6
        max_detections_per_class: 100
        max_total_detections: 100
      }
      score_converter: SOFTMAX
    }
    second_stage_localization_loss_weight: 2.0
    second_stage_classification_loss_weight: 1.0
  }
}

train_config: {
  batch_size: 2
  optimizer {
    momentum_optimizer: {
      learning_rate: {
        manual_step_learning_rate {
          initial_learning_rate: 0.003
          schedule {
            step: 25000
            learning_rate: 0.0003
          }
          schedule {
            step: 40000
            learning_rate: 0.00003
          }
        }
      }
      momentum_optimizer_value: 0.9
    }
    use_moving_average: false
  }
  gradient_clipping_by_norm: 10.0
  fine_tune_checkpoint: "/work/bh163/misc/object_detection/data/pretrained_model/model.ckpt"
  from_detection_checkpoint: true
  load_all_detection_checkpoint_vars: true
  num_steps: 50000
  data_augmentation_options {
    random_horizontal_flip {
    }
    random_vertical_flip{
    }
    random_rotation90{
    }
  }
}

train_input_reader: {
  tf_record_input_reader {
    input_path: "/work/bh163/misc/object_detection/data/train.record"
  }
  label_map_path: "/work/bh163/misc/object_detection/data/label_map.pbtxt"
  shuffle: true
}

eval_config: {
  metrics_set: "coco_detection_metrics"
  num_examples: 2000
}

eval_input_reader: {
  tf_record_input_reader {
    input_path: "/work/bh163/misc/object_detection/data/valid.record"
  }
  label_map_path: "/work/bh163/misc/object_detection/data/label_map.pbtxt"
  shuffle: false
  num_readers: 1
}
